# TODO  Напишите функцию count_letters
def count_letters(text):
    dictionary = {}                                             # создадим пустой словарь
    length = 0                                                  # счетчик для хранения количества букв в тексте
    lower_text = text.lower()                                   # переведем все символы в нижний регистр и положим в новую переменную
    for symbol in lower_text:                                   # для каждого символа в новой переменной:
        if symbol.isalpha():                                        # если символ является буквой, тогда:
            length += 1                                                 # увеличиваем счетчик на единицу и
            dictionary[symbol] = dictionary.get(symbol, 0) + 1          # добавляем в словарь символ (ключ), а если символ уже есть икрементим значение на единицу
    return dictionary, length                                   # возвращаем словарь и счетчик


# TODO Напишите функцию calculate_frequency
def calculate_frequency(dict, size):
    new_dictionary = {}                                         # создадим новый пустой словарь
    for symbol in dict:                                         # для каждого символа в словаре (словарь из первой функции полученный аргумент):
        frequency = dict.get(symbol) / size                         # вычисляем частоту буквы
        frequency = round(frequency, 2)                             # округляем частоту
        new_dictionary[symbol] = frequency                          # добавляем в новый словарь букву (ключ) и ее частоту (значение)
    return new_dictionary                                       # возвращаем словарь

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

dictionary = (count_letters(main_str)[0])                          # создаем переменную и присваиваем ей возвращенный из первой функции словарь
length = (count_letters(main_str)[1])                              # создаем переменную и присваиваем ей возвращенный из первой функции счетчик
new_dictionary = calculate_frequency(dictionary, length)           # запуск второй функции и сохранение значений в новом словаре

# TODO Распечатайте в столбик букву и её частоту в тексте
for key, value in new_dictionary.items():                          # обход нового словаря для получения все пар ключ-значение
  print("{0}: {1:.2f}".format(key, value))                         # вывод результатов
