salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
months = 10  # Количество месяцев, которое планируется протянуть без долгов
increase = 0.03  # Ежемесячный рост цен

# TODO Рассчитайте подушку безопасности, чтобы протянуть 10 месяцев без долгов

# Формула расчета финансовой подушки для 1-го месяца: финподушка на месяц = расходы - зарплата
# Формула финансовой подушки для последующих месяцев: финподушка на месяц = расходы + (расходы * рост цен) - зарплата
# Подушка безопасности равна сумме всех 10 месячных финансовых подушек

money_capital = 0  # Подушка безопасности
i = 1

for i in range(1, months + 1):
    if i > 1:
        spend = spend + (spend * increase)  # Увеличение расходов на заданный %
        money_capital_part = spend - salary  # Финансовая подушка со 2-го по 10-й месяцы
    else:
        money_capital_part = spend - salary  # Финансовая подушка на первый месяц
    i += 1
    money_capital += money_capital_part  # Подушка безопасности (сумма всех финансовых подушек за 10 месяцев)

print(f"Подушка безопасности, чтобы протянуть {months} месяцев без долгов:", round(money_capital))
