users = ['user1', 'user2', 'user3', 'user1', 'user4', 'user2']

# TODO Добавьте словарь и замените в нем нулевые значения статисчикой посещений
# Создадим словарь с двумя ключами
dict_ = {
    "Общее количество": 0,
    "Уникальные посещения": 0
}

# Установим новое значение для ключа "Общее количество"
dict_["Общее количество"] = len(users)

# Посчитаем уникальные значения, переведя список в множество, и добавим его в значение ключа "Уникальные посещения"
set_users = set(users)
dict_["Уникальные посещения"] = len(set_users)

# Выведем словарь
print(dict_)
